#### 📖 Terraform Plan ('infra/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.function_app.azurerm_storage_blob.featured_institutions will be created
  + resource "azurerm_storage_blob" "featured_institutions" {
      + access_tier            = (known after apply)
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "featured-institutions.json"
      + parallelism            = 8
      + size                   = 0
      + source                 = "featured-institutions.json"
      + storage_account_name   = "iopitnsvcappbestfn01"
      + storage_container_name = "static-content"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.function_app.azurerm_storage_blob.featured_services will be created
  + resource "azurerm_storage_blob" "featured_services" {
      + access_tier            = (known after apply)
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "featured-services.json"
      + parallelism            = 8
      + size                   = 0
      + source                 = "featured-services.json"
      + storage_account_name   = "iopitnsvcappbestfn01"
      + storage_container_name = "static-content"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.function_app.azurerm_storage_container.static_content will be created
  + resource "azurerm_storage_container" "static_content" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "static-content"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "iopitnsvcappbestfn01"
    }

  # module.function_app.module.app_be_fn.module.storage_account.azurerm_storage_account.this will be destroyed
  # (because azurerm_storage_account.this is not in configuration)
  - resource "azurerm_storage_account" "this" {
      - access_tier                       = "Hot" -> null
      - account_kind                      = "StorageV2" -> null
      - account_replication_type          = "ZRS" -> null
      - account_tier                      = "Standard" -> null
      - allow_nested_items_to_be_public   = false -> null
      - cross_tenant_replication_enabled  = false -> null
      - default_to_oauth_authentication   = false -> null
      - dns_endpoint_type                 = "Standard" -> null
      - enable_https_traffic_only         = true -> null
      - id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvcappbefn01st" -> null
      - infrastructure_encryption_enabled = false -> null
      - is_hns_enabled                    = false -> null
      - local_user_enabled                = true -> null
      - location                          = "italynorth" -> null
      - min_tls_version                   = "TLS1_2" -> null
      - name                              = "iopitnsvcappbefn01st" -> null
      - nfsv3_enabled                     = false -> null
      - primary_access_key                = (sensitive value) -> null
      - primary_blob_connection_string    = (sensitive value) -> null
      - primary_blob_endpoint             = "https://iopitnsvcappbefn01st.blob.core.windows.net/" -> null
      - primary_blob_host                 = "iopitnsvcappbefn01st.blob.core.windows.net" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_dfs_endpoint              = "https://iopitnsvcappbefn01st.dfs.core.windows.net/" -> null
      - primary_dfs_host                  = "iopitnsvcappbefn01st.dfs.core.windows.net" -> null
      - primary_file_endpoint             = "https://iopitnsvcappbefn01st.file.core.windows.net/" -> null
      - primary_file_host                 = "iopitnsvcappbefn01st.file.core.windows.net" -> null
      - primary_location                  = "italynorth" -> null
      - primary_queue_endpoint            = "https://iopitnsvcappbefn01st.queue.core.windows.net/" -> null
      - primary_queue_host                = "iopitnsvcappbefn01st.queue.core.windows.net" -> null
      - primary_table_endpoint            = "https://iopitnsvcappbefn01st.table.core.windows.net/" -> null
      - primary_table_host                = "iopitnsvcappbefn01st.table.core.windows.net" -> null
      - primary_web_endpoint              = "https://iopitnsvcappbefn01st.z38.web.core.windows.net/" -> null
      - primary_web_host                  = "iopitnsvcappbefn01st.z38.web.core.windows.net" -> null
      - public_network_access_enabled     = true -> null
      - queue_encryption_key_type         = "Service" -> null
      - resource_group_name               = "io-p-itn-svc-rg-01" -> null
      - secondary_access_key              = (sensitive value) -> null
      - secondary_connection_string       = (sensitive value) -> null
      - sftp_enabled                      = false -> null
      - shared_access_key_enabled         = true -> null
      - table_encryption_key_type         = "Service" -> null
      - tags                              = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "IO Enti & Servizi"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        } -> null

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.ai_search.module.srch_snet.azurerm_subnet.this,
  on .terraform/modules/ai_search.srch_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
